configuration.org
#+title: SOUL Emacs
#+author: 2e Asteroid

* Why?
I've always been searching for some program that would just click for me: Obsidian, Vivaldi, VS Code, Vim, etc. The program should feel intuitive to me, and easy to use. However, I haven't found that program. Therefore, I'm just going to use Emacs and make the program that I'm looking for. To do that, I'm implementing a literate configuration file.
* Planning / Roadmap
 - Find better fonts
 - Customized theme
 - Better mode line
 - One mode line (header line) + Chimera Tabs ?
 - Customized Dashboard
 - Make Corfu work smoothly
 - LSP / TS modes
 - Smooth and easy LaTeX
 - Custom packages for music, exercising, workflow
 - Customized EMMS
 - Ctags and stuff
 - Keyboard system
   - Multi-cursors
   - modal?
   - Smart
 - Inferior modes for langs
 - Ace stuff?
 - Sunrise Commander
 - tree file explorer
 - Flycheck
 - AI
 - Learn magit
 - eat / vterm
 - notmuch
 - emacs browser thing
* Configuration Settings
Here I define certain settings for this configuration. Based on those settings,
some modules might not be loaded.
#+begin_src emacs-lisp :tangle "init.el"
  (defcustom use-exwm nil
    "Whether or not you want to use EXWM. Set to t if you do."
    :type :boolean)
  (defcustom csl-style-directory "~/.emacs.d/data/csl-styles/"
    "The directory where csl styles are stored (for reference management). By default they are stored in the above directory."
   :type :directory)
  (defcustom use-pdfview nil
    "Whether or not you want to use PDFView. Set to t if you do."
    :type :boolean)
#+end_src
* Early Initialization of Emacs (=early-init.el=)
All of the code here will be tangled to =early-init.el=.
** =early-init.el='s Tweaks to Startup Time
Hacks for better startup times will be placed here, once I come up with them.
** =early-init.el='s Basic Frame Settings
#+begin_src emacs-lisp :tangle "early-init.el"
  (setq frame-resize-pixelwise t                           ; Makes sure that you can resize the window by pixels (obselete since I use EXWM)
        frame-title-format '("%b")                         ; Makes the title of the window the buffer name
        ring-bell-function 'ignore                         ; Stops the error bell sound
        use-short-answers t                                ; Instead of yes or no, it uses y / n
        inhibit-splash-screen t                            ; Stops the starting screen from showing.
        inhibit-startup-echo-area-message user-login-name) ; Stops the starting minibuffer message from showing.

  (menu-bar-mode -1)                                       ; Stops the menu bar from showing (text)
  (scroll-bar-mode -1)                                     ; Stops the scroll bar from showing (scroll)
  (tool-bar-mode -1)                                       ; Stops the tool bar from showing (icons)
  (tooltip-mode -1)                                        ; Instead of a help thing showing up from hovering, it displays the message in the minibuffer
#+end_src
** =early-init.el='s Initial Flash of Light
I haven't /really/ noticed this problem, but I think it does happen. I'm using Protesilaos' function, but removed dependencies.
#+begin_src emacs-lisp :tangle "early-init.el"
  (defun prot-emacs-avoid-initial-flash-of-light ()
    "avoid flash of light when starting emacs, if needed."
    (setq mode-line-format nil)
    (set-face-attribute 'default nil :background "#000000" :foreground "#000000")
    (set-face-attribute 'mode-line nil :background "#000000" :foreground "#000000" :box 'unspecified))

  (prot-emacs-avoid-initial-flash-of-light)
#+end_src

* Initialization of Emacs (=init.el=)
** =init.el='s Package Manager (=straight.el=)
I've never really noticed this package manager, but after switching to NixOS, I've realized that reproducibility is a must, and that's exactly what this package manager offers. This will hopefully make sure that I can use the same configuration file everywhere without question.

The file directive is a list that can have the following options:
 - =:defaults= :: Uses the default thing, which is enough for most packages
 - Cons Cell :: Maps the CAR of the cell to the CDR of the cell, very simple but tedious
 - List, String :: The string is basically the directory that you want the other strings to be in
 - List, =:exclude= :: The strings in the list will be excluded
 - String :: This will expand into a list of cons cells that also removes directories
#+begin_src emacs-lisp :tangle "init.el"
  ;;; Bootstrapping straight.el
  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
        (bootstrap-version 5))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))

  ;;; Stop Checking of Modifications
  (setq straight-check-for-modifications nil) ; This stops the package manager from checking for modifications to package source code, and makes this a conscious process (call 'straight-rebuild-package')
#+end_src
** =init.el='s Declare Custom Themes Safe
Emacs gives an annoying confirmation sequence whenever you load a theme, so this prevents that.
#+begin_src emacs-lisp :tangle "init.el"
  (setq custom-safe-themes t) ; Sets custom themes to be safe.
#+end_src
** =init.el='s Theme Initialization
The question of the theme is not one that I have a ready answer for. I plan on using a custom theme that I'll make myself, but it takes a lot of time and effort which strays from everything else, so themes will be the last thing to add. I also plan on using autothemer.
Because it looks unreadable without a theme, I will be using a temporary theme.
#+begin_src emacs-lisp :tangle "init.el"
  ;;; Theme
  (straight-use-package
   '(autothemer :type git
                :host github
                :repo "jasonm23/autothemer"
                :files ("autothemer.el")))

  (require 'autothemer)

  (load-theme 'soul-theme t)
#+end_src
** =init.el='s all-the-icons Support
I've read some stuff about =all-the-icons= v. =nerd-icons=, and I can say with some certainty that there's not much of a difference between them. The only differences are that =nerd-icons= is more unified, but I don't know if it supports some of what =all-the-icons= does, which is why I'm going to be using =all-the-icons=, until I find out if it /does/ support those features.

https://github.com/mohkale/all-the-icons-nerd-fonts seems like an option.

One thing about all-the-icons is that it's stupidly hard to build, because it needs some files which are in a subdirectory.
#+begin_src emacs-lisp :tangle "init.el"
  (straight-use-package
   '(all-the-icons :type git
                   :host github
                   :repo "domtronn/all-the-icons.el"
                   :files (:defaults ("data" "data/data-*.el"))))

  (require 'all-the-icons)
  (let ((default-directory "~/.emacs.d/data/all-the-icons/"))
    (if (not (file-directory-p "~/.emacs.d/data/all-the-icons/"))
        (progn (make-directory "~/.emacs.d/data/all-the-icons/" t)
               (all-the-icons-install-fonts t))))
#+end_src
** =init.el='s Backup File Uninvolvement
The surest way to leak data. Backing up files can be replaced by regulated git management.
#+begin_src emacs-lisp :tangle "init.el"
  (setq-default delete-by-moving-to-trash nil ; When you delete a file, it will not be moved to the trash instead
                recentf-mode t              ; You can see files that you have recently been in
                make-backup-files nil)        ; Don't create backups of the file every modification save. You can choose between renaming and copying, but there's a difference?
#+end_src
** =init.el='s Encoding System (UTF-8)
Emacs keeps on bothering me with these encoding messages, so I had to define it here.
#+begin_src emacs-lisp :tangle "init.el"
  (set-default-coding-systems 'utf-8)
  (set-language-environment "UTF-8")
  (setq locale-coding-system 'utf-8)
  (set-terminal-coding-system 'utf-8)
  (set-keyboard-coding-system 'utf-8)
  (set-selection-coding-system 'utf-8)
  (prefer-coding-system 'utf-8)
#+end_src
** =init.el='s Module Arrangements
Code that I write for my configuration as well as configurations of other packages (except for theme and all-the-icons) will be in the directory 'modules', and this adds it to the load path, which is a list of directories that Emacs will search through for Emacs Lisp libraries (code you wrote) to load (which you specify elsewhere with 'load').
#+begin_src emacs-lisp :tangle "init.el"
  (add-to-list 'load-path (locate-user-emacs-file "modules"))
#+end_src
** =init.el='s Add Function to Multiple Hooks
Sometimes I want to add a function to multiple hooks. This accomplishes that.
#+begin_src emacs-lisp :tangle "init.el"
  (defun add-function-to-hooks (function hooks)
    "Adds FUNCTION to every hook in the list HOOK."
    (mapc (lambda (hook)
            (add-hook hook function))
          hooks))
#+end_src
** =init.el='s Loading of Modules
Here I load all of my modules.
Make sure that the modeline module comes after
the timer module. Make sure that the EXWM module goes first. Make sure that
dashboard is in front of essentials.
#+begin_src emacs-lisp :tangle "init.el"
  ;; SYSTEM
  (if use-exwm
      (require 'emacs-x-wm))
  (require 'gc-magic-hack)
  (require 'no-litter)
  (require 'essentials)
  (require 'fonts)
  ;; EXTENSION
  (require 'undoing)
  (if use-pdfview
      (require 'pdfs))
  (require 'emacs-dashboard)
  (require 'coding)
  (require 'ogre)
  (require 'latech)
  (require 'zettelkasten)
  (require 'citation)
  (require 'completion-stack)
  (require 'projecting)
  (require 'infofiche)
  (require 'chem)
  (require 'cookie-cutter)
  (require 'music)
#+end_src

* Emacs Configuration Modules (=modules/=)
** The =essentials.el= Module
This provides some basic settings on Emacs itself; no packages. Delaying this execution by 1 second will speed up the loading of Emacs.
