configuration.org
*** =essentials.el='s Sane Defaults
Just a bunch of random settings.
#+begin_src emacs-lisp :tangle "modules/essentials.el"
  (setq-default ad-redefinition-action 'warn            ; When we redefine an active function then deactivate it, it will accept the redefinition as the new definition, but warn us. Might change to 'accept
                confirm-kill-emacs 'y-or-n-p            ; Asks us y / n if we want to kill emacs.
                cursor-in-non-selected-windows nil      ; Only show the cursor in the frame that we are in.
                display-time-default-load-average nil   ; Removes the load average from the time displayed. Might be obselete since we redefine the time format.
                display-time-format "%k:%M:%S (%Z)"     ; Format of the time displayed. It displays it as 24 hour time basically, with the time removed by timezone in parentheses
                help-window-select t                    ; Puts the focus (cursor) on the help window we opened
                indent-tabs-mode nil                    ; Indentation does not add tabs but just indents somehow
                initial-scratch-message ""              ; Starting text in the scratch buffer. Replace it with libraries for coding in the future?
                mouse-yank-at-point t                   ; Allows mouse to paste text at the cursor not at the click
                select-enable-clipboard t               ; Copy-pasting uses system clipboard (but still have kill-ring functionality)
                sentence-end-double-space nil           ; Makes the sentence (something for text navigation) be defined by one space, not two.
                blink-cursor-mode nil                   ; Don't blink the cursor
                tab-width 4                             ; Sets a tab to be four spaces
                x-stretch-cursor nil                    ; Cursor is a constant size and doesn't change based on text under it
                delete-old-versions t                   ; Asks for confirmation for removing excess backup versions
                version-control t                       ; Use version control to number backup versions
                inhibit-compacting-font-caches t        ; Stops the font cache from compacting -> higher memory footprint but increases speed for certain fonts
                display-line-numbers-type 'relative     ; Display line numbers relatively (current line has the actual line number and the others have the distance between them and the current line)
                use-default-font-for-symbols nil        ; Use the actual fontset for symbols and punctuation instead of defaulting to default font
                blink-matching-paren nil                ; Don't flash matching parentheses
                delete-pair-blink-delay 0.1             ; How long to delay the command 'delete-pair'
                save-interprogram-paste-before-kill t   ; Saves clipboard text into kill-ring before replacing it
                mode-require-final-newline 'visit-save  ; Adds a newline (if it doesn't already have one) to the end of files when you first open it and when you save
                eval-expression-print-length nil        ; When returning the value of an evaluated expression, don't truncate it at all
                scroll-conservatively 101               ; When the cursor leaves the screen, scroll up/down enough text to /just/ bring the cursor back into view
                backup-by-copying t                     ; Instead of symlinking, make a copy for the backup. Apparently symlinks are bad ?
                tab-always-indent 'complete             ; First trys to indent, then complete
                kill-do-not-save-duplicates t)          ; When saving something to the kill ring, if it duplicates the last entry, don't save it.

  (cd "~/")
#+end_src
*** =essentials.el='s Show/Remove Trailing Whitespace
This sets up how trailing whitespace (whitespace after the last character in a
line) is shown. When I save, the trailing whitespace is removed.
#+begin_src emacs-lisp :tangle "modules/essentials.el"
  (setq-default show-trailing-whitespace t) ; Show trailing whitespace after a line for cleanup
  (add-function-to-hooks (lambda () (setq show-trailing-whitespace nil))
                         '(calendar-mode-hook
                           dashboard-mode-hook
                           undo-tree-visualize-mode-hook
                           chemtable-mode-hook
                           chemtable-info-mode-hook))

  (add-hook 'before-save-hook 'delete-trailing-whitespace) ; Delete whitespace when I save
#+end_src
*** =essentials.el='s Fullscreen
Makes Emacs fullscreen, unless I'm using EXWM.
#+begin_src emacs-lisp :tangle "modules/essentials.el"
  (if (not use-exwm)
      (if (string-equal window-system 'ns)
          (toggle-frame-maximized)
        (toggle-frame-fullscreen)))
#+end_src
*** =essentials.el='s Garbage Collect Buffer Upon Focusing Out
When I focus out of a buffer, the buffer will garbage collect.
#+begin_src emacs-lisp :tangle "modules/essentials.el"
  (add-hook 'focus-out-hook #'garbage-collect)
#+end_src
*** =essentials.el='s Delete Selection Mode
This mode essentially allows you to just delete selected text with a backspace.
It's commonplace to see in modern applications so it's just easier overall to
have this enabled.
#+begin_src emacs-lisp :tangle "modules/essentials.el"
  (delete-selection-mode 1)
#+end_src
*** =essentials.el='s Global Auto Revert Mode
When a file changes in the disk, reflect that change in the buffer shown. And
have it be this way for all files and buffers.
#+begin_src emacs-lisp :tangle "modules/essentials.el"
  (global-auto-revert-mode 1)
#+end_src
*** =essentials.el='s Electric Modes
There's a few "electric" modes which basically just means that it does things
automatically. The ones here are 'electric-pair-mode' which adds a closing
parenthesis, bracket, or something, and 'electric-indent-mode', which
automatically indents. Electric Pair Mode is simplistic, but there are a few
things which I don't like about it, such as the behavior of deleting layered
parentheses of:
(...
())
where if you start at the end of the inner pair and delete the closing
parenthesis, it doesn't remove the starting pair, which if you delete that, will
delete the closing pair of the outer parentheses. In conclusion, electric pair
mode is not the final solution, and will be replaced by something else once I
find / make one.
Electric Indent Mode seems fine and simplistic, but might be replaced by
Aggressive Indent Mode once I figure out the benchmarks of that.
#+begin_src emacs-lisp :tangle "modules/essentials.el"
  (electric-pair-mode t)   ; Turns on Electric Pair Mode globally
  (electric-indent-mode t) ; Turns on Electric Indent Mode globally
#+end_src
*** =essentials.el='s Replace Yes/No with y/n
I don't think I'll ever need yes/no, so I'm replacing yes/no as an alias for
y/n.
#+begin_src emacs-lisp :tangle "modules/essentials.el"
  (defalias 'yes-or-no-p 'y-or-n-p) ; Sets yes/no to be y/n
#+end_src
*** =essentials.el='s Background Transparency
Transparency of Emacs is pretty cool and this is a custom function to do exactly that, pulled from EmacsWiki (great site). I don't know if the code works though -- it should!
#+begin_src emacs-lisp :tangle "modules/essentials.el"
  (set-frame-parameter nil 'alpha-background 100)
  (add-to-list 'default-frame-alist '(alpha-background . 100))

  (defun toggle-transparency ()
    (interactive)
    (if (>= (string-to-number emacs-version) 29.0)
        (let ((alpha-background (frame-parameter nil 'alpha-background)))
          (set-frame-parameter
           nil 'alpha-background
           (if (eql (cond ((numberp alpha-background) alpha-background)
                          ((numberp (cdr alpha-background)) (cdr alpha-background))
                          ;; Also handle undocumented (<active> <inactive>) form.
                          ((numberp (cadr alpha-background)) (cadr alpha-background)))
                    100)
               85
             100)))
      (let ((alpha-background (frame-parameter nil 'alpha)))
        (set-frame-parameter
         nil 'alpha
         (if (eql (cond ((numberp alpha-background) alpha-background)
                        ((numberp (cdr alpha-background)) (cdr alpha-background))
                        ;; Also handle undocumented (<active> <inactive>) form.
                        ((numberp (cadr alpha-background)) (cadr alpha-background)))
                  100)
             '(85 . 50)
           '(100 . 100))))))
#+end_src
*** =essentials.el='s Global Subword Mode
Global Subword Mode enables subword-mode globally, which makes a word to be
split by capital letters too (helps with Pascal Case and camelCase).
#+begin_src emacs-lisp :tangle "modules/essentials.el"
  (global-subword-mode)  ; Enables global subword mode
#+end_src
*** =essentials.el='s Show Parentheses
This marks pairing parentheses with a special color, and improves visibility
overall.
#+begin_src emacs-lisp :tangle "modules/essentials.el"
  (setq show-paren-delay 0)  ; Don't delay the parentheses showing
  (show-paren-mode 1)
#+end_src
