configuration.org
*** =essentials.el='s Mouse Config
Makes the mouse more usable. TODO Document the code more.
#+begin_src emacs-lisp :tangle "modules/essentials.el"
  (setq mouse-wheel-scroll-amount
        '(1
          ((shift) . 5)
          ((meta) . 0.5)
          ((control) . text-scale))
        mouse-drag-copy-region nil
        make-pointer-invisible t
        mouse-wheel-progressive-speed t
        mouse-wheel-follow-mouse t)

  (setq-default scroll-preserve-screen-position t
                scroll-conservatively 1
                scroll-margin 0
                next-screen-context-lines 0)

  (mouse-wheel-mode 1)
  (define-key global-map (kbd "C-M-<mouse-3>") #'tear-off-window)
#+end_src
*** =essentials.el='s Sudo Find File
#+begin_src emacs-lisp :tangle "modules/essentials.el"
  (defun sudo-find-file (file-name)
  "Like find file, but opens the file as root."
  (interactive "FSudo Find File: ")
  (let ((tramp-file-name (concat "/sudo::" (expand-file-name file-name))))
    (find-file tramp-file-name)))
#+end_src
*** =essentials.el='s Provide
#+begin_src emacs-lisp :tangle "modules/essentials.el"
  (provide 'essentials)
#+end_src
** The =fonts.el= Module
This file manages fonts, ligatures, and generally how text looks. I use Fantasque Sans Mono as my default
font, with different backups depending on whether I'm using Windows or Linux.
For Linux, the fonts should be covered by NixOS.
Fonts that you have to download:
 - Windows
   - Unifont
     [[https://unifoundry.com/pub/unifont/unifont-15.1.04/font-builds/unifont-15.1.04.otf][Standard Unifont]]
     [[https://unifoundry.com/pub/unifont/unifont-15.1.04/font-builds/unifont_upper-15.1.04.otf][Unifont Upper]]
 - Linux
   - Noto Color Emoji
     [[https://github.com/googlefonts/noto-emoji/raw/main/fonts/NotoColorEmoji.ttf][Noto Color Emoji]]
   - Unifont
     [[https://unifoundry.com/pub/unifont/unifont-15.1.04/font-builds/unifont-15.1.04.otf][Standard Unifont]]
     [[https://unifoundry.com/pub/unifont/unifont-15.1.04/font-builds/unifont_upper-15.1.04.otf][Unifont Upper]]
*** =fonts.el='s Fontsetting
This determines the fonts available.
#+begin_src emacs-lisp :tangle "modules/fonts.el"
  (cond ((string-equal window-system 'w32) (progn
                                             (when (member "Segoe UI Emoji" (font-family-list))
                                               (set-fontset-font t 'symbol (font-spec :family "Segoe UI Emoji") nil 'prepend)
                                               (set-fontset-font "fontset-default" '(#xFE00 . #xFE0F) "Segoe UI Emoji"))

                                             (when (member "Times New Roman" (font-family-list))
                                               (set-fontset-font "fontset-default" 'unicode "Times New Roman"))

                                             (when (member "Unifont" (font-family-list))
                                               (set-fontset-font t nil "Unifont" nil 'append)
                                               (set-fontset-font t nil "Unifont Upper" nil 'append)))
         (string-equal window-system 'x) (progn
                                           (when (member "Noto Color Emoji" (font-family-list))
                                             (set-fontset-font t 'symbol (font-spec :family "Noto Color Emoji") nil 'prepend)
                                             (set-fontset-font "fontset-default" '(#xFE00 . #xFE0F) "Noto Color Emoji"))

                                           (when (member "Unifont" (font-family-list))
                                             (set-fontset-font t nil "Unifont" nil 'append)
                                             (set-fontset-font t nil "Unifont Upper" nil 'append)))))

#+end_src
*** =fonts.el='s Rainbow Mode
This mode highlights color codes with the color they are. I think it's useful so
I keep it around
#+begin_src emacs-lisp :tangle "modules/fonts.el"
  ;;; Rainbow Mode
  (straight-use-package
   '(rainbow-mode :type git
                  :host github
                  :repo "emacsmirror/rainbow-mode"
                  :files (:defaults)))
  (require 'rainbow-mode)

  (add-hook 'prog-mode-hook 'rainbow-mode) ; Adds rainbow-mode to all programming modes.
  (setq rainbow-x-colors nil)              ; Prevents words like 'gold' from being highlighted
#+end_src
*** =fonts.el='s Ligatures
I am currently using fira code mode, but the preferred solution is
`ligature.el`, which I will switch to in the future.
#+begin_src emacs-lisp :tangle "modules/fonts.el"
    ;;; Fira Code Mode
  (straight-use-package
   '(fira-code-mode :type git
                    :host github
                    :repo "jming422/fira-code-mode"
                    :files (:defaults)))

  (require 'fira-code-mode)

  (unless (member "Fira Code Symbol" (font-family-list))
    (fira-code-mode-install-fonts))

  (fira-code-mode-set-font)
  (setq fira-code-mode-disabled-ligatures '("*" "?=" "[]" "x"))
  (add-hook 'prog-mode-hook 'fira-code-mode)
#+end_src
*** =fonts.el='s Provide
#+begin_src emacs-lisp :tangle "modules/fonts.el"
  (provide 'fonts)
#+end_src
** The =no-litter.el= Module
Many packages / features in Emacs have data they want to keep in a file. The
question is, where? This results in many scattered data / config files around
your system. No Littering.el is meant to combat this dilemma.
#+begin_src emacs-lisp :tangle "modules/no-litter.el"
  ;;; No Littering
  (straight-use-package
   '(no-littering :type git
                  :host github
                  :repo "emacscollective/no-littering"
                  :files (:defaults)))

  (defvar no-littering-etc-directory
        (expand-file-name "config/" user-emacs-directory))
  (defvar no-littering-var-directory
        (expand-file-name "data/" user-emacs-directory))

  (require 'no-littering)
  #+end_src
*** =no-litter.el=: Disable no-littering files from appearing in recentf
I think this is intuitive to understand and shouldn't warrant any more explanations.
#+begin_src emacs-lisp :tangle "modules/no-litter.el"
  (require 'recentf)
  (add-to-list 'recentf-exclude                                          ; Excludes all no-littering files from recentf
               (recentf-expand-file-name no-littering-var-directory))
  (add-to-list 'recentf-exclude                                          ; ^
               (recentf-expand-file-name no-littering-etc-directory))
#+end_src
*** =no-litter.el='s Storing Interactive Configurations in a Custom File (=custom.el=)
Interactive configurations will appear in your =init.el= if you don't do this,
which is quite annoying.
#+begin_src emacs-lisp :tangle "modules/no-litter.el"
  (setq custom-file (no-littering-expand-etc-file-name "custom.el"))     ; Stores Emacs' configuration interface in the config folder, called custom.el
#+end_src
*** =no-litter.el='s Provide
#+begin_src emacs-lisp :tangle "modules/no-litter.el"
  (provide 'no-litter)
#+end_src
** The =gc-magic-hack.el= Module
The Garbage Collector Magic Hack is a package that changes the garbage
collection threshold (how much data used before removing data we don't need)
whenever we go idle and back. When we are actively using our Emacs, you should
ideally not garbage collect at all. Only when we aren't doing anything should we
garbage collect.
#+begin_src emacs-lisp :tangle "modules/gc-magic-hack.el"
    (straight-use-package
     '(gcmh :type git
            :host github
            :repo "emacsmirror/gcmh"
            :files (:defaults)))
    (require 'gcmh)
#+end_src
*** =gc-magic-hack.el='s Configuration
#+begin_src emacs-lisp :tangle "modules/gc-magic-hack.el"
  (setq gcmh-low-cons-threshold 800000   ; 800 kB
        gcmh-high-cons-threshold 3200000 ; 1.6 mB
        gcmh-idle-delay 20               ; 15 sec.
        gcmh-verbose t)                  ; Tells us when it garbage collects.
  (gcmh-mode)
#+end_src
*** =gc-magic-hack.el='s Provide
#+begin_src emacs-lisp :tangle "modules/gc-magic-hack.el"
  (provide 'gc-magic-hack)
#+end_src
** The =emacs-dashboard.el= Module
This configures the startup dashboard, a buffer that appears at the start of
Emacs and stays in Emacs. It contains some quick information and looks cool
generally.
#+begin_src emacs-lisp :tangle "modules/emacs-dashboard.el"
  (straight-use-package
   '(dashboard :type git
               :host github
               :repo "emacs-dashboard/emacs-dashboard"
               :files (:defaults "banners/*.txt")))
#+end_src
*** =emacs-dashboard.el='s Configuration
This has the actual configuration code.
#+begin_src emacs-lisp :tangle "modules/emacs-dashboard.el"
  (dashboard-setup-startup-hook)  ; Sets up dashboard to show at startup
  (setq dashboard-banner-logo-title "Chimera Systems™") ; You can also propertize the title and have it be (propertize "TITLE" 'face FACE)
  (setq dashboard-startup-banner 1)  ; Change this to my own banner in the future
  (setq dashboard-center-content t
        dashboard-set-heading-icons t)
#+end_src
*** =emacs-dashboard.el='s Provide
#+begin_src emacs-lisp :tangle "modules/emacs-dashboard.el"
  (provide 'emacs-dashboard)
#+end_src
** The =pdfs.el= Module
This is almost leaving Emacs' capabilities, because of its transition from text
to graphics.
*** =pdfs.el='s DocView Configuration
DocView is the default pdf reader for Emacs. It turns pages of the pdf into
images then loads those images. In effect, it is slow and cumbersome. However,
if we cannot get our hands on PDF-tools, DocView will have to do.

TODO Document what it actually does.
#+begin_src emacs-lisp :tangle "modules/pdfs.el"
  (setq doc-view-scale-internally t
        doc-view-resolution 600)
#+end_src
*** =pdfs.el='s PDF-tools Configuration
This is the good stuff. It stores the PDF data in memory instead of as images
and is consequently faster.
#+begin_src emacs-lisp :tangle "modules/pdfs.el"
  (straight-use-package
   '(pdf-tools :type git
               :host github
               :repo "vedang/pdf-tools"
               :files (:defaults)))

  (require 'pdf-tools)
  (pdf-tools-install)
#+end_src
*** =pdfs.el='s Provide
#+begin_src emacs-lisp :tangle "modules/pdfs.el"
  (provide 'pdfs)
#+end_src
** The =undoing.el= Module
Emacs has a rich undo system, with things like a tree instead of a single line of undo points.
#+begin_src emacs-lisp :tangle "modules/undoing.el"
  (setq undo-limit 1000000)   ; The undo limit is the max amount of bytes of undo data to store. I think 1 mB is enough for now (I can change it later).
#+end_src
