configuration.org
*** =undoing.el='s Undo Fu
I used to use Undo-Tree, but after comparing the security issues with the backups it creates and the potential for data corruption, I've decided to move to Undo Fu for a more safe experience.
#+begin_src emacs-lisp :tangle "modules/undoing.el"
  (straight-use-package
   '(undo-fu :type git
             :host github
             :repo "emacsmirror/undo-fu"
             :files (:defaults)))

  (require 'undo-fu)

  ;; Switch these later
  (global-set-key (kbd "C-/")   'undo-fu-only-undo)
  (global-set-key (kbd "C-S-/") 'undo-fu-only-redo)
#+end_src
*** =undoing.el='s Provide
#+begin_src emacs-lisp :tangle "modules/undoing.el"
  (provide 'undoing)
#+end_src
** The =citation.el= Module
Citations are actually kind of hard to set up, at least in my current experience. This whole module is dedicated to making citations work.
*** =citation.el='s Zotra
Zotra performs essentially the same task as Zotero, except you don't need the client open and you can run this in Emacs.
#+begin_src emacs-lisp :tangle "modules/citation.el"
  (straight-use-package
   '(zotra :type git
           :host github
           :repo "mpedramfar/zotra"
           :files (:defaults)))

  (require 'zotra)

  (setq zotra-default-bibliography (expand-file-name "biblio.bib" org-roam-directory))
#+end_src
*** =citation.el='s Org-Cite
Org-cite is a built-in org-mode system for reference handling.
#+begin_src emacs-lisp :tangle "modules/citation.el"
  (straight-use-package
   '(oc :type built-in))

  (require 'oc)

  (setq org-cite-global-bibliography
        '("~/.emacs.d/zettels/biblio.bib"))

  (setq org-cite-export-processors
        `((md . (csl ,(expand-file-name "chicago-fullnote-bibliography.csl" csl-style-directory)))
          (latex biblatex)
          (odt . (csl ,(expand-file-name "chicago-fullnote-bibliography.csl" csl-style-directory)))
          (t . (csl ,(expand-file-name "chicago-fullnote-bibliography.csl" csl-style-directory)))))
#+end_src
*** =citation.el='s Citeproc
Citeproc is a CSL processor for Emacs that works with Org-Cite to allow for CSL-based citing.
#+begin_src emacs-lisp :tangle "modules/citation.el"
  (straight-use-package
   '(citeproc :type git
              :host github
              :repo "andras-simonyi/citeproc-el"
              :files (:defaults)))

  (require 'citeproc)
#+end_src
*** =citation.el='s Citar
Citar is a citation displayer that looks better than the default. Citar-Org-Roam also allows me to create notes on references in my bibliography through =citar-open-notes= (to create notes the first time) and =citar-open-note= (to open already existing notes).
#+begin_src emacs-lisp :tangle "modules/citation.el"
  (straight-use-package
   '(citar :type git
           :host github
           :repo "emacs-citar/citar"
           :files (:defaults)))

  (require 'citar)

  (setq org-cite-insert-processor 'citar
        org-cite-follow-processor 'citar
        org-cite-activate-processor 'citar
        citar-bibliography org-cite-global-bibliography)

  (straight-use-package
   '(citar-org-roam :type git
                    :host github
                    :repo "emacs-citar/citar-org-roam"
                    :files (:defaults)))

  (require 'citar-org-roam)

  (citar-register-notes-source
   'orb-citar-source (list :name "Zettels"
                           :category 'org-roam-node
                           :items #'citar-org-roam--get-candidates
                           :hasitems #'citar-org-roam-has-notes
                           :open #'citar-org-roam-open-note
                           :create #'orb-citar-edit-note
                           :annotate #'citar-org-roam--annotate))

  (setq citar-org-roam-note-title-template "${author editor} :: ${title}"
        citar-org-roam-capture-template-key "r"
        citar-notes-source 'orb-citar-source)

  (citar-org-roam-mode) ; Has to be after everything above
#+end_src
*** =citation.el='s Provide
#+begin_src emacs-lisp :tangle "modules/citation.el"
  (provide 'citation)
#+end_src
** The =ogre.el= Module
This is the whole of all Org Mode configurations that I made. Org Mode is one of
the flagship features of Emacs in my opinion, a fully featured customizable
markup language (and general productivity / writing messiah) which can replace
most if not all tools in your toolkit, like notebooks, ... more examples, etc.
#+begin_src emacs-lisp :tangle "modules/ogre.el"
  (straight-use-package
   '(org :type built-in))  ; Uses the built-in version of org.

  (require 'org)
#+end_src
*** =ogre.el='s Core Customization
These are all of the main customizations of the central module 'org'.
#+begin_src emacs-lisp :tangle "modules/ogre.el"
  (setq org-ellipsis nil                               ; Uses ... for hidden org headlines, which might change in the future.
        org-startup-folded t                           ; Folds and hides org headlines at startup
        org-pretty-entities t                          ; Makes certain characters display as UTF-8 unicode symbols.
        org-auto-align-tags t                          ; Keeps org tags aligned always
        org-fold-catch-invisible-edits 'show-and-error ; When editing text inside a hidden area, open the headline and abort edit
        org-special-ctrl-a/e t                         ; Makes C-a and C-e be special in a headline
        org-image-actual-width 1000                    ; Messes things up
        org-insert-heading-respect-content t           ; When adding a new headline, have it respect the current tree you're in
        org-hide-emphasis-markers t                    ; Hides markup characters
        org-startup-indented t)                        ; Start org modes with text under a headline indented to the depth of the headline.

  (add-hook 'org-mode-hook 'visual-line-mode) ; Makes Org Mode display with visual lines (smart wrapping)

  ;; I also have to add org modules once I know what I want to add
  (setq org-modules '(ol-doi
                      ol-w3m
                      ol-bbdb
                      ol-bibtex
                      ol-docview
                      ol-gnus
                      ol-info
                      ol-irc
                      ol-mhe
                      ol-rmail
                      ol-eww
                      org-habit))
#+end_src
*** =ogre.el='s Org Agenda Stuff
Org Agenda is an aggregation of all your tasks, creating this master view of everything you need to do. Pretty cool.
#+begin_src  emacs-lisp :tangle "modules/ogre.el"
  (require 'org-agenda)

  (setq org-todo-keywords '((sequence "TODO(t)" "NEXT(n!)" "WAITING(w@/!)" "|" "DONE(d!)" "CANCELED(c@/!)")) ; Setq todo keywords to that sequence
        org-agenda-block-separator ?-       ; Sets the block separator to ?-
        org-agenda-time-grid '((daily today require-timed)              ; Explain Later
                               (800 1000 1200 1400 1600 1800 2000)
                               " ┄┄┄┄┄ " "┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄")
        org-agenda-current-time-string "◀-- now -------------------------------------------------"
        org-agenda-files '("~/.emacs.d/work/tasks.org")
        org-agenda-tags-column org-tags-column
        org-agenda-sticky t
        org-agenda-inhibit-startup nil
        org-agenda-dim-blocked-tasks nil
        org-agenda-compact-blocks nil
        org-deadline-warning-days 7)
#+end_src
*** =ogre.el='s Edit Org LaTeX in Separate Buffer
The customization for this breaches the LaTeX configuration, so this only loads
the package and leave the customization for LaTeX.
#+begin_src emacs-lisp :tangle "modules/ogre.el"
  (straight-use-package
   '(org-edit-latex :type git
                    :host github
                    :repo "et2010/org-edit-latex"
                    :files (:defaults)))

  (require 'org-edit-latex)
#+end_src
*** =ogre.el='s Org Bullets
This package replaces the asterisk in the headlines to other symbols instead. We of course have to first hide leading stars for the headlines so it shows only one. Add back the tangle later.
#+begin_src emacs-lisp :tangle "modules/ogre.el"
  (setq org-hide-leading-stars t)

  (straight-use-package
   '(org-bullets :type git
                 :host github
                 :repo "sabof/org-bullets"
                 :files (:defaults)))

  (require 'org-bullets)
  (add-hook 'org-mode-hook (lambda ()
                             (org-bullets-mode 1)))

  (setq org-bullets-bullet-list '("⦿" "○" "◎"))
#+end_src
*** =ogre.el='s Org Modern
Org Modern is a package that adds a modern text processing feel to org mode, adding basically syntax sugar to everything. This is currently not in use (add the tangle back when needed).
#+begin_src emacs-lisp
  (straight-use-package
   '(org-modern :type git
                :host github
                :repo "minad/org-modern"
                :files (:defaults)))

  (require 'org-modern)
  (with-eval-after-load 'org (global-org-modern-mode))  ; Runs #'global-org-modern-mode which enables org-modern globally, after org
#+end_src
*** =ogre.el='s Org Capture Templates
Org capture is a special system within Emacs / Org Mode where you can pull up a temporary buffer anywhere (in Emacs) and write things in there. The text written will be transferred to a file. This is especially useful for Org-Roam, where you can collect your fleeting thoughts.
#+begin_src emacs-lisp :tangle "modules/ogre.el"
  (eval-after-load "zettelkasten"
    '(setq org-capture-templates
           `(("t" "Task" entry (file "~/.emacs.d/work/tasks.org")
              "* TODO %^{Task}\nADDED: %T\nDEADLINE: %^{DEADLINE}t\n\n%?\n")
             ("p" "Project" entry (file "~/.emacs.d/work/tasks.org")
              "* %? :PROJECT:\n")
             ("s" "Slipbox" entry (file ,(expand-file-name "inbox.org" org-roam-directory))
              "* %T\n%?\n"))))

  ;; These are the refiling targets for org-capture
  (setq org-refile-targets '((org-agenda-files . (:tag . "PROJECT"))))
#+end_src
