configuration.org
*** =ogre.el='s Special Fonts
I like to use proportional serif fonts for Org-Mode, like ETBembo. Currently, this is not in use, with it not being tangled to the file. When I want to use it in the future, I'll re-add the tangle.
#+begin_src emacs-lisp
  (let* ((variable-tuple
          ;; Sets 'variable-tuple to '(:font "ETBembo") if it can find it
          (cond ((x-list-fonts "ETBembo")         '(:font "ETBembo"))
                ;; Sets 'variable-tuple to '(:fonts "Times New Roman") is it can find it
                ((x-list-fonts "Times New Roman") '(:font "Times New Roman"))
                ;; Sets 'variable-tuple to '(:fonts "Sans Serif") if it can find one
                ((x-family-fonts "Sans Serif")    '(:family "Sans Serif"))
                (nil (warn "Cannot find a Sans Serif Font.  Install a Sans Serif font."))))
         ;; Sets 'base-font-color to the default face's text color
         (base-font-color     (face-foreground 'default nil 'default))
         ;; Sets 'headline to this p-list?
         (headline           `(:inherit default :weight ultra-bold :foreground ,base-font-color)))

    ;; Sets the org level faces with the special font and color
    (custom-theme-set-faces
     'user
     `(org-level-8 ((t (,@headline ,@variable-tuple))))
     `(org-level-7 ((t (,@headline ,@variable-tuple))))
     `(org-level-6 ((t (,@headline ,@variable-tuple))))
     `(org-level-5 ((t (,@headline ,@variable-tuple))))
     `(org-level-4 ((t (,@headline ,@variable-tuple :height 1.1))))
     `(org-level-3 ((t (,@headline ,@variable-tuple :height 1.2))))
     `(org-level-2 ((t (,@headline ,@variable-tuple :height 1.4))))
     `(org-level-1 ((t (,@headline ,@variable-tuple :height 1.5))))
     `(org-document-title ((t (,@headline ,@variable-tuple :height 1.5 :underline nil))))))

  ;; Sets the variable pitch face and the fixed pitch face, and makes org mode be variable-pitch
  (custom-theme-set-faces
   'user
   '(variable-pitch ((t (:family "ETBembo" :height 185 :weight thin))))
   '(fixed-pitch ((t ( :family "Fantasque Sans Mono" :height 185)))))
  (add-hook 'org-mode-hook 'variable-pitch-mode)

  (custom-theme-set-faces
   'user
   ;; Sets text in org blocks to be fixed-pitch and delimiters as well
   '(org-block ((t (:inherit fixed-pitch))))
   '(org-block-begin-line ((t (:inherit shadow fixed-pitch))))
   '(org-block-end-line ((t (:inherit shadow fixed-pitch))))
   ;; Sets code snippets to be shadowed and fixed-pitch
   '(org-code ((t (:inherit (shadow fixed-pitch)))))
   ;; Sets the org document information to be orange
   '(org-document-info ((t (:foreground "dark orange"))))
   ;; Sets the keywords (#+TITLE:, etc) to be shadowed and fixed-pitch
   '(org-document-info-keyword ((t (:inherit (shadow fixed-pitch)))))
   ;; Sets the org-indent face (to hide extra asterisks) to be invisible and fixed-pitch
   '(org-indent ((t (:inherit (org-hide fixed-pitch)))))
   ;; Sets links to be blue and underlined
   '(org-link ((t (:foreground "royal blue" :underline t))))
   ;; Sets the text for meta lines (#+begin_src, etc) to be the font and colors of comments and also fixed-pitch
   '(org-meta-line ((t (:inherit (font-lock-comment-face fixed-pitch)))))
   ;; Sets org property value text to be fixed pitch as well
   '(org-property-value ((t (:inherit fixed-pitch))) t)
   ;; Sets org special keywords to be commented and fixed pitch
   '(org-special-keyword ((t (:inherit (font-lock-comment-face fixed-pitch)))))
   ;; Sets org tables to be also fixed-pitch and with a special font color
   '(org-table ((t (:inherit fixed-pitch :foreground "#83a598"))))
   ;; Sets the org tags to be bold, smaller, with shadowed fixed pitch text
   '(org-tag ((t (:inherit (shadow fixed-pitch) :weight bold :height 0.8))))
   ;; Sets the verbatim text (==) to be shadowed and fixed pitch
   '(org-verbatim ((t (:inherit (shadow fixed-pitch))))))

  ;; Sets the line spacing in org files to be a bit bigger
  (add-hook 'org-mode-hook (lambda () (setq line-spacing 0.4)))
#+end_src
*** =ogre.el='s Provide
#+begin_src emacs-lisp :tangle "modules/ogre.el"
  (provide 'ogre)
#+end_src
** The =latech.el= Module
LaTeX is a typesetting (display stuff in a special way) system for mathematics and science in general. It's useful and Emacs is a great editor for it.
#+begin_src emacs-lisp :tangle "modules/latech.el"
  (straight-use-package
   '(auctex :type git
            :host github
            :repo "emacs-straight/auctex"
            :files ("*" (:exclude ".git"))))

  (require 'auctex)
#+end_src
*** =latech.el='s Core Customization
These are all basic tex settings with no additional dependencies. Probably.
#+begin_src emacs-lisp :tangle "modules/latech.el"

  (setq TeX-command-default (if (executable-find "latexmk") "LatexMk" "LaTeX")  ; the default command for running tex files
        TeX-engine (if (executable-find "xetex") 'xetex 'default)  ; The engine for tex
        TeX-auto-save t  ; Whether to save style info when you save the file
        TeX-parse-self t  ; Parse the file if there's no style hook
        TeX-syntactic-comment t  ; Non-nil comments parsed to specification
        TeX-auto-local ".auctex-auto"  ; Where to put auto-gen tex info
        TeX-style-local ".auctex-style"  ; Where to put hand-made tex info
        TeX-source-correlate-mode t  ; A connection from the output and the source can be made
        TeX-source-correlate-method 'synctex  ; Other package for syncing between output and source
        TeX-source-correlate-start-server nil  ; Don't auto-start the correlation server
        TeX-electric-sub-and-superscript t  ; Add braces when you use sub/super script in tex
        TeX-fill-break-at-separators nil  ; Don't auto hard-wrap stuff
        TeX-electric-math '("\\( " . " \\)")  ; Allows for auto completion of a starting inline equation.
        TeX-master t ; All files are probably master files
        TeX-save-query t)  ; Ask to save before starting tex

  (add-hook 'TeX-mode-hook #'visual-line-mode)
#+end_src
*** =latech.el='s Default TeX-mode Configuration
The default major mode for displaying TeX files is tex-mode.
#+begin_src emacs-lisp :tangle "modules/latech.el"
  (straight-use-package
   '(tex-mode :type built-in))

  (require 'tex-mode)

  (setq LaTeX-section-hook '(LaTeX-section-heading
                             LaTeX-section-title
                             LaTeX-section-toc
                             LaTeX-section-section
                             LaTeX-section-label)
        LaTeX-fill-break-at-separators nil
        LaTeX-item-indent 0)
#+end_src
*** =latech.el='s Provide
#+begin_src emacs-lisp :tangle "modules/latech.el"
  (provide 'latech)
#+end_src
** The =completion-stack.el= Module
There are many different ways to do things in Emacs. There are defaults like ido, or huge systems like helm and ivy, or not using any of those at all. The searching stack of packages I use is the *V* ertico - *O* rderless - *M* arginalia - *C* onsult - *E* mbark - *C* orfu - *C* ape - *T* empel Stack.
*** =completion-stack.el='s Vertico Configuration
Vertico is a completion user interface that displays completion options vertically. Some of the benefits it offers are:
 - Uses native API for completion
 - Highly extensible
#+begin_src emacs-lisp :tangle "modules/completion-stack.el"
  (straight-use-package
   '(vertico :type git
             :host github
             :repo "minad/vertico"
             :files (:defaults "extensions/*")))

  (require 'vertico)
  (require 'vertico-indexed)
  (require 'vertico-mouse)
  (require 'vertico-multiform)
  (require 'vertico-reverse)
  (require 'vertico-quick)
  (require 'vertico-buffer)


  (vertico-mode) ; Starts Vertico
  (setq vertico-cycle t) ; When you reach the end or top, it cycles to the top / end

  (setq read-extended-command-predicate #'command-completion-default-include-p) ; Stops commands from showing in M-x if it doesn't apply to the current mode
#+end_src
*** =completion-stack.el='s Marginalia Configuration
Marginalia is a small package that displays metadata along with the entry in the completion UI for Vertico. I find it useful most of the time, and it's generally good to have.
#+begin_src emacs-lisp :tangle "modules/completion-stack.el"
  (straight-use-package
     '(marginalia :type git
                  :host github
                  :repo "minad/marginalia"
                  :files (:defaults)))

    (require 'marginalia)

    (marginalia-mode)

    (setq marginalia-max-relative-age 2592000 ; For time-based metadata (like time created) how far do we want to go (30 days) before switching from a relative (5 days ago) date to a fixed date (December 31st, 2020)
          marginalia-align 'right) ; How we align the annotations: to the right
#+end_src
*** =completion-stack.el='s Icons for Completion
There are two different methods for showing icons in Emacs: all-the-icons and nerd-icons. I'm using all-the-icons right now, but nerd-icons seems better in the long run. I'm using the all-the-icons-completion package to show icons.
#+begin_src emacs-lisp :tangle "modules/completion-stack.el"
  (straight-use-package
   '(all-the-icons-completion :type git
                              :host github
                              :repo "iyefrat/all-the-icons-completion"
                              :files (:defaults)))

   (require 'all-the-icons-completion)

   (all-the-icons-completion-mode) ; Turns on icons
   (add-hook 'marginalia-mode-hook #'all-the-icons-completion-marginalia-setup) ; Sets up the icons when annotations are set up.
#+end_src
*** =completion-stack.el='s Orderless Configuration
Orderless is a completion style where the pattern is divided into different components and it uses these components to match in any order of the components.
#+begin_src emacs-lisp :tangle "modules/completion-stack.el"
  (straight-use-package
   '(orderless :type git
               :host github
               :repo "oantolin/orderless"
               :files (:defaults)))

  (require 'orderless)

  (setq completion-styles '(orderless basic) ; Sets the default style to be orderless with basic as a backup
        completion-category-defaults nil     ; Don't have defaults for most categories (override if necessary)
        completion-category-overrides '((file (styles basic partial-completion)))) ; For files, we want to not use orderless, and instead stick with basic and partial completion (e.x. /e/n/c -> /etc/nixos/configuration.nix)


#+end_src
