modules/completion-stack.el
(straight-use-package
 '(vertico :type git
           :host github
           :repo "minad/vertico"
           :files (:defaults "extensions/*")))

(require 'vertico)
(require 'vertico-indexed)
(require 'vertico-mouse)
(require 'vertico-multiform)
(require 'vertico-reverse)
(require 'vertico-quick)
(require 'vertico-buffer)


(vertico-mode) ; Starts Vertico
(setq vertico-cycle t) ; When you reach the end or top, it cycles to the top / end

(setq read-extended-command-predicate #'command-completion-default-include-p) ; Stops commands from showing in M-x if it doesn't apply to the current mode

(straight-use-package
   '(marginalia :type git
                :host github
                :repo "minad/marginalia"
                :files (:defaults)))

  (require 'marginalia)

  (marginalia-mode)

  (setq marginalia-max-relative-age 2592000 ; For time-based metadata (like time created) how far do we want to go (30 days) before switching from a relative (5 days ago) date to a fixed date (December 31st, 2020)
        marginalia-align 'right) ; How we align the annotations: to the right

(straight-use-package
 '(all-the-icons-completion :type git
                            :host github
                            :repo "iyefrat/all-the-icons-completion"
                            :files (:defaults)))

 (require 'all-the-icons-completion)

 (all-the-icons-completion-mode) ; Turns on icons
 (add-hook 'marginalia-mode-hook #'all-the-icons-completion-marginalia-setup) ; Sets up the icons when annotations are set up.

(straight-use-package
 '(orderless :type git
             :host github
             :repo "oantolin/orderless"
             :files (:defaults)))

(require 'orderless)

(setq completion-styles '(orderless basic) ; Sets the default style to be orderless with basic as a backup
      completion-category-defaults nil     ; Don't have defaults for most categories (override if necessary)
      completion-category-overrides '((file (styles basic partial-completion)))) ; For files, we want to not use orderless, and instead stick with basic and partial completion (e.x. /e/n/c -> /etc/nixos/configuration.nix)

(straight-use-package
 '(corfu :type git
         :host github
