configuration.org
*** =completion-stack.el='s Corfu x Cape Configuration
Corfu is an in-buffer completion framework designed to work for Vertico. It will provide the function completions for our code and such.
#+begin_src emacs-lisp :tangle "modules/completion-stack.el"
  (straight-use-package
   '(corfu :type git
           :host github
           :repo "minad/corfu"
           :files (:defaults "extensions/*")))

  (straight-use-package
   '(cape :type git
          :host github
          :repo "minad/cape"
          :files (:defaults)))

  (require 'corfu)
  (require 'cape)

  (setq corfu-cycle t            ; Cycle through the options
        corfu-auto t             ; Auto completion (opens menu automatically)
        corfu-auto-prefix 2      ; How many characters you type before it pops up; I think 2 is pretty great because for smaller symbols it won't pop up.
        corfu-auto-delay 1       ; How long to wait; I've found that it becomes annoying when it constantly pops up when I don't want it to.
        corfu-preview-current t) ; Preview the current option

  (global-corfu-mode)   ; Sets up Corfu globally

  (add-to-list 'completion-at-point-functions #'cape-file)      ; Allows Corfu to complete file paths
  (add-to-list 'completion-at-point-functions #'cape-elisp-block)   ; Allows Corfu to complete in source code blocks (Org)

  (defun corfu-enable-in-minibuffer ()
    "Enable Corfu in the minibuffer."
    (when (local-variable-p 'completion-at-point-functions)
      (setq-local corfu-auto t) ;; Enable/disable auto completion
      (setq-local corfu-echo-delay 3 ;; Disable automatic echo and popup
                  corfu-popupinfo-delay 3)
      (corfu-mode 1)))

  (add-hook 'minibuffer-setup-hook #'corfu-enable-in-minibuffer)

  (defun corfu-move-to-minibuffer ()
    (interactive)
    (pcase completion-in-region--data
      (`(,beg ,end ,table ,pred ,extras)
       (let ((completion-extra-properties extras)
             completion-cycle-threshold completion-cycling)
         (consult-completion-in-region beg end table pred)))))

  (keymap-set corfu-map "M-m" #'corfu-move-to-minibuffer)

  (add-to-list 'corfu-continue-commands #'corfu-move-to-minibuffer)
#+end_src
*** =completion-stack.el='s Consult Configuration
Consult provides back-end functions for completion that are essentially nicer functions for finding things, etc.
#+begin_src emacs-lisp :tangle "modules/completion-stack.el"
  (straight-use-package
   '(consult :type git
             :host github
             :repo "minad/consult"
             :files (:defaults)))

  (require 'consult)
#+end_src
*** =completion-stack.el='s Provide
#+begin_src emacs-lisp :tangle "modules/completion-stack.el"
  (provide 'completion-stack)
#+end_src
** The =zettelkasten.el= Module
This module is about Org-Roam and my Zettelkasten system in Emacs. I have deemed this package to be worthy enough to be an entire section.
#+begin_src emacs-lisp :tangle "modules/zettelkasten.el"
  (straight-use-package
   '(org-roam :type git
              :host github
              :repo "org-roam/org-roam"
              :files (:defaults)))

  (require 'org-roam)
#+end_src
*** =zettelkasten.el='s Core Configurations
These are basic configurations for Org Roam.
#+begin_src emacs-lisp :tangle "modules/zettelkasten.el"
  (setq org-roam-verbose t
        org-roam-directory "~/.emacs.d/zettels/") ; Add org roam directory later
  (org-roam-setup)
#+end_src
*** =zettelkasten.el='s Capture Templates
We separate our zettelkasten into two slipboxes: a reference one and a main one. The reference slipbox will hold zettels that come from reference material, while the main one will be our original thoughts, which can have some basis on reference zettels.
#+begin_src emacs-lisp :tangle "modules/zettelkasten.el"
  (setq org-roam-capture-templates
        '(("m" "main" plain "%?"
           :if-new (file+head "main/${slug}.org"
                              "#+title: ${title}\n")
           :immediate-finish t
           :unnarrowed t)
          ("r" "reference" plain "%?"
           :if-new (file+head "reference/${citar-citekey}.org"
                              "#+title: ${note-title}\n")
           :immediate-finish t
           :unnarrowed t)
          ("h" "hierarchy" plain "%?"
           :if-new (file+head "reference/${slug}.org"
                              "#+title: ${hierarchy-title}\n")
           :immediate-finish t
           :unnarrowed t)
          ("c" "companion" plain "%?"
           :if-new (file+head "reference/${slug}.org"
                              ":PROPERTIES:
      :ROAM_REFS: @%(citar-select-ref)
      :END:
#+title: ${title}\n")
           :immediate-finish t
           :unnarrowed t)))
#+end_src
*** =zettelkasten.el='s Tagging for Different Slipboxes
We want to show the slipbox that different notes are in, in our completion menu, so we derive this tagging method.
#+begin_src emacs-lisp :tangle "modules/zettelkasten.el"
  (cl-defmethod org-roam-node-type ((node org-roam-node))
    "Return the TYPE of NODE."
    (condition-case nil
        (file-name-nondirectory
         (directory-file-name
          (file-name-directory
           (file-relative-name (org-roam-node-file node) org-roam-directory))))
      (error "")))

  (setq org-roam-node-display-template
        (concat "${type:15} ${hierarchy}${title:*} " (propertize "${tags:10}" 'face 'org-tag)))
#+end_src
*** =zettelkasten.el='s Evergreen Notes Implementation
Evergreen notes is a system that can work conjointly with Zettelkasten. It promotes that all notes are drafts, and will only be complete over time.
#+begin_src emacs-lisp :tangle "modules/zettelkasten.el"
  (defun tag-new-node-as-draft ()
    (org-roam-tag-add '("draft")))
  (add-hook 'org-roam-capture-new-node-hook #'tag-new-node-as-draft)
#+end_src
*** =zettelkasten.el='s Capture to Inbox
We collect our fleeting thoughts through an inbox, where we can =org-capture= into.
#+begin_src emacs-lisp :tangle "modules/zettelkasten.el"
  (defun org-roam-capture-slipbox ()
    (interactive)
    (org-capture nil "s"))
#+end_src
*** =zettelkasten.el='s Change Slug from Underscore to Dash
In Org-Roam, the slug text replacement will take the title and trim / replace things that are hard to display with a file name. This will overwrite the slug function.
#+begin_src emacs-lisp :tangle "modules/zettelkasten.el"
  (require 'ucs-normalize) ; Allows for the unicode normalizing representation function

  (cl-defmethod org-roam-node-slug ((node org-roam-node))
    "Return the slug of NODE."
    (let ((title (org-roam-node-title node))
          (slug-trim-chars '(;; Combining Diacritical Marks https://www.unicode.org/charts/PDF/U0300.pdf
                             768 ; U+0300 COMBINING GRAVE ACCENT
                             769 ; U+0301 COMBINING ACUTE ACCENT
                             770 ; U+0302 COMBINING CIRCUMFLEX ACCENT
                             771 ; U+0303 COMBINING TILDE
                             772 ; U+0304 COMBINING MACRON
                             774 ; U+0306 COMBINING BREVE
                             775 ; U+0307 COMBINING DOT ABOVE
                             776 ; U+0308 COMBINING DIAERESIS
                             777 ; U+0309 COMBINING HOOK ABOVE
                             778 ; U+030A COMBINING RING ABOVE
                             780 ; U+030C COMBINING CARON
                             795 ; U+031B COMBINING HORN
                             803 ; U+0323 COMBINING DOT BELOW
                             804 ; U+0324 COMBINING DIAERESIS BELOW
                             805 ; U+0325 COMBINING RING BELOW
                             807 ; U+0327 COMBINING CEDILLA
                             813 ; U+032D COMBINING CIRCUMFLEX ACCENT BELOW
                             814 ; U+032E COMBINING BREVE BELOW
                             816 ; U+0330 COMBINING TILDE BELOW
                             817 ; U+0331 COMBINING MACRON BELOW
                             )))
      (cl-flet* ((nonspacing-mark-p (char)
                   (memq char slug-trim-chars))
                 (strip-nonspacing-marks (s)
                   (ucs-normalize-NFC-string
                    (apply #'string (seq-remove #'nonspacing-mark-p
                                                (ucs-normalize-NFD-string s)))))
                 (cl-replace (title pair)
                   (replace-regexp-in-string (car pair) (cdr pair) title)))
        (let* ((pairs `(("[^[:alnum:][:digit:].]" . "-") ;; convert anything not alphanumeric or a dot
                        ("--*" . "-")                   ;; remove sequential underscores
                        ("^-" . "")                     ;; remove starting underscore
                        ("-$" . "")))                   ;; remove ending underscore
               (slug (-reduce-from #'cl-replace (strip-nonspacing-marks title) pairs)))
          (downcase slug)))))
#+end_src
