modules/completion-stack.el
         :repo "minad/corfu"
         :files (:defaults "extensions/*")))

(straight-use-package
 '(cape :type git
        :host github
        :repo "minad/cape"
        :files (:defaults)))

(require 'corfu)
(require 'cape)

(setq corfu-cycle t            ; Cycle through the options
      corfu-auto t             ; Auto completion (opens menu automatically)
      corfu-auto-prefix 2      ; How many characters you type before it pops up; I think 2 is pretty great because for smaller symbols it won't pop up.
      corfu-auto-delay 1       ; How long to wait; I've found that it becomes annoying when it constantly pops up when I don't want it to.
      corfu-preview-current t) ; Preview the current option

(global-corfu-mode)   ; Sets up Corfu globally

(add-to-list 'completion-at-point-functions #'cape-file)      ; Allows Corfu to complete file paths
(add-to-list 'completion-at-point-functions #'cape-elisp-block)   ; Allows Corfu to complete in source code blocks (Org)

(defun corfu-enable-in-minibuffer ()
  "Enable Corfu in the minibuffer."
  (when (local-variable-p 'completion-at-point-functions)
    (setq-local corfu-auto t) ;; Enable/disable auto completion
    (setq-local corfu-echo-delay 3 ;; Disable automatic echo and popup
                corfu-popupinfo-delay 3)
    (corfu-mode 1)))

(add-hook 'minibuffer-setup-hook #'corfu-enable-in-minibuffer)

(defun corfu-move-to-minibuffer ()
  (interactive)
  (pcase completion-in-region--data
    (`(,beg ,end ,table ,pred ,extras)
     (let ((completion-extra-properties extras)
           completion-cycle-threshold completion-cycling)
       (consult-completion-in-region beg end table pred)))))

(keymap-set corfu-map "M-m" #'corfu-move-to-minibuffer)

(add-to-list 'corfu-continue-commands #'corfu-move-to-minibuffer)

(straight-use-package
 '(consult :type git
           :host github
           :repo "minad/consult"
           :files (:defaults)))

(require 'consult)

(provide 'completion-stack)
