configuration.org
*** =zettelkasten.el='s Dendroam Configuration
Dendroam is a package that attaches Dendron features to Org Roam. This gives the power of structured notes to Zettelkasten, which is useful for things like software which has a clearly defined schema.
One must comment out the slug replacement function at the end of this package. It does not work as of now (might pull request a fix in the future).
#+begin_src emacs-lisp :tangle "modules/zettelkasten.el"
  (straight-use-package
   '(dendroam :type git
              :host github
              :repo "vicrdguez/dendroam"
              :files (:defaults)))

  (require 'dendroam)
#+end_src
*** =zettelkasten.el='s BibTex Configuration
This allows for Org Roam to be integrated with bibliography management software.
#+begin_src emacs-lisp :tangle "modules/zettelkasten.el"
  (straight-use-package
   '(org-roam-bibtex :type git
                     :host github
                     :repo "org-roam/org-roam-bibtex"
                     :files (:defaults)))

  (require 'org-roam-bibtex)

  (setq bibtex-completion-bibliography '("~/.emacs.d/zettels/biblio.bib"))   ; This allows bibtex-completion to not throw a fit
#+end_src
*** =zettelkasten.el='s Provide
#+begin_src emacs-lisp :tangle "modules/zettelkasten.el"
  (provide 'zettelkasten)
#+end_src
** The =infofiche.el= Module
Infofiche is an imaginary means of storing information, akin to paper, but reusable like electronics, in the Teixcalaanli Empire series. This module will handle all types of information management and inflow.
*** =infofiche.el='s Elfeed Setup
Elfeed is an RSS reader in Emacs, which can gather data from multiple sources and show them in a list format.
#+begin_src emacs-lisp :tangle "modules/infofiche.el"
  (straight-use-package
   '(elfeed :type git
            :host github
            :repo "skeeto/elfeed"
            :files (:defaults)))

  (require 'elfeed)
#+end_src
*** =infofiche.el='s Elfeed-Org Setup
Elfeed-org allows inputting of elfeed feeds through an org file, way more organized than a lisp structure.
#+begin_src emacs-lisp :tangle "modules/infofiche.el"
  (straight-use-package
   '(elfeed-org :type git
                :host github
                :repo "remyhonig/elfeed-org"
                :files (:defaults)))

  (require 'elfeed-org)

  (elfeed-org) ; Inits the process
#+end_src
*** =infofiche.el='s Elfeed Scoring Setup
Elfeed can be cluttered sometimes with random things from random places. This adjusts how entries are displayed, with more relevant entries higher.
#+begin_src emacs-lisp :tangle "modules/infofiche.el"
  (straight-use-package
   '(elfeed-score :type git
                  :host github
                  :repo "sp1ff/elfeed-score"
                  :files (:defaults)))

  (require 'elfeed-score)
  (elfeed-score-enable) ; Inits it
#+end_src
*** =infofiche.el='s Provide
#+begin_src emacs-lisp :tangle "modules/infofiche.el"
  (provide 'infofiche)
#+end_src
** The =coding.el= Module
I would argue that the primary use of Emacs is to write code, being that it /is/ a text editor after all. That being said, this module contains all the resources needed to start programming.
*** =coding.el='s Eglot Configuration
#+begin_src emacs-lisp :tangle "modules/coding.el"
  (straight-use-package
   '(eglot :type built-in))

  (require 'eglot)
#+end_src
*** =coding.el='s Treesitter Configuration
#+begin_src emacs-lisp :tangle "modules/coding.el"
  (straight-use-package
   '(treesit :type built-in))

  (straight-use-package
   '(treesit-auto :type git
                  :host github
                  :repo "renzmann/treesit-auto"
                  :files (:defaults)))

  (require 'treesit)
  (require 'treesit-auto)

  (setq treesit-auto-install nil
        treesit-auto-add-to-auto-mode-alist 'all)
  (global-treesit-auto-mode)
#+end_src
*** =coding.el='s Nix Mode
NixOS is a Linux distribution that focuses on reproducibility, which is what I am using. This major mode allows me to edit Nix files.
#+begin_src emacs-lisp :tangle "modules/coding.el"
  (straight-use-package
   '(nix-mode :type git
              :host github
              :repo "NixOS/nix-mode"
              :files (:defaults)))

  (require 'nix-mode)
  (require 'nix-drv-mode)
  (require 'nix-shell)
  (require 'nix-repl)
  (add-to-list 'auto-mode-alist '("\\.nix\\'" . nix-mode)) ; Makes all *.nix files use nix-mode.

#+end_src
*** =coding.el='s Highlight Numbers Mode
One thing that really irks me about the Regex syntax highlighting is that it never gets the number literals, even with 'font-lock-number-face', etc. This will help absolve the issue by introducing actual number highlighting.
#+begin_src emacs-lisp :tangle "modules/coding.el"
  (straight-use-package
   '(highlight-numbers :type git
                       :host github
                       :repo "Fanael/highlight-numbers"
                       :files (:defaults)))

  (require 'highlight-numbers)

  (add-hook  'prog-mode-hook 'highlight-numbers-mode) ; Makes all programming modes have number literals be highlighted
#+end_src
*** =coding.el='s Provide
#+begin_src emacs-lisp :tangle "modules/coding.el"
  (provide 'coding)
#+end_src
** The =projecting.el= Module
This manages project management. Add more later.
#+begin_src emacs-lisp :tangle "modules/projecting.el"
  (straight-use-package
   '(projectile :type git
                :host github
                :repo "bbatsov/projectile"
                :files (:defaults)))

  (require 'projectile)
#+end_src
*** =projecting.el='s Projectile Configuration
Projectile is a package that provides a modern implementation of project management.
#+begin_src emacs-lisp :tangle "modules/projecting.el"
  (projectile-mode +1) ; Turns on projectile
#+end_src
*** =projecting.el='s Provide
#+begin_src emacs-lisp :tangle "modules/projecting.el"
  (provide 'projecting)
#+end_src
** The =chem.el= Module
I have a few packages for chemistry-related stuff (periodic table, etc) and I use them here.
*** =chem.el='s Periodic Table
The package =chemtable= is an Emacs periodic table that you can use to get information about various elements.
#+begin_src emacs-lisp :tangle "modules/chem.el"
  (straight-use-package
   '(chemtable :type git
               :host github
               :repo "sergiruiztrepat/chemtable"
               :files (:defaults)))

  (require 'chemtable)
#+end_src
*** =chem.el='s Balance Chemical Reactions
This package balances a chemical equation that you pass into it.
#+begin_src emacs-lisp :tangle "modules/chem.el"
  (straight-use-package
   '(chembalance :type git
                 :host github
                 :repo "sergiruiztrepat/chembalance"
                 :files (:defaults)))

  (require 'chembalance)

  (setq chembalance-arrow-syntax '("=" "=>" "→" "->"))
#+end_src
*** =chem.el='s Find Molar Mass
The package =molar-mass= will calculate the molar mass of a given molecule / element.
#+begin_src emacs-lisp :tangle "modules/chem.el"
  (straight-use-package
   '(molar-mass :type git
                :host github
                :repo "sergiruiztrepat/molar-mass"
                :files (:defaults)))

  (require 'molar-mass)
#+end_src
*** =chem.el='s Provide
#+begin_src emacs-lisp :tangle "modules/chem.el"
  (provide 'chem)
#+end_src
** The =cookie-cutter.el= Module
This module focuses on templates/snippets, kind of like a cookie cutter for more cookies. I use tempel as my basic snippet system, with cdlatex for latex in org files.
*** =cookie-cutter.el='s Tempel Core Configuration
#+begin_src emacs-lisp :tangle "modules/cookie-cutter.el"
  (straight-use-package
   '(tempel :type git
            :host github
            :repo "minad/tempel"
            :files (:defaults)))

  (require 'tempel)

  (setq tempel-trigger-prefix nil)

  (add-to-list 'completion-at-point-functions #'tempel-complete)
#+end_src
*** =cookie-cutter.el='s File Template Configuration
#+begin_src emacs-lisp :tangle "modules/cookie-cutter.el"

#+end_src
*** =cookie-cutter.el='s CDLatex Configuration
CDLatex is a minor mode promoting fast insertion of LaTeX.
#+begin_src emacs-lisp :tangle "modules/cookie-cutter.el"
  (straight-use-package
   '(cdlatex :type git
             :host github
             :repo "cdominik/cdlatex"
             :files (:defaults)))

  (require 'cdlatex)

  (add-hook 'LaTeX-mode-hook #'turn-on-cdlatex)   ; with AUCTeX LaTeX mode
  (add-hook 'latex-mode-hook #'turn-on-cdlatex)   ; with Emacs latex mode
  (add-hook 'org-mode-hook #'turn-on-org-cdlatex) ; with Org Mode

  (setq cdlatex-command-alist '(("ang"         "Insert \\ang{}"
                                 "\\ang{?}" cdlatex-position-cursor nil t t)
                                ("si"          "Insert \\SI{}{}"
                                 "\\SI{?}{}" cdlatex-position-cursor nil t t)
                                ("sl"          "Insert \\SIlist{}{}"
                                 "\\SIlist{?}{}" cdlatex-position-cursor nil t t)
                                ("sr"          "Insert \\SIrange{}{}{}"
                                 "\\SIrange{?}{}{}" cdlatex-position-cursor nil t t)
                                ("num"         "Insert \\num{}"
                                 "\\num{?}" cdlatex-position-cursor nil t t)
                                ("nl"          "Insert \\numlist{}"
                                 "\\numlist{?}" cdlatex-position-cursor nil t t)
                                ("nr"          "Insert \\numrange{}{}"
                                 "\\numrange{?}{}" cdlatex-position-cursor nil t t)
                                ("fr"          "Insert \\frac{}{}"
                                 "\\frac{}{}" cdlatex-position-cursor nil t t)
                                ("rt"          "Insert \\sqrt[]{}"
                                 "\\sqrt[?]{}" cdlatex-position-cursor nil t t)))
#+end_src
*** =cookie-cutter.el='s Provide
#+begin_src emacs-lisp :tangle "modules/cookie-cutter.el"
  (provide 'cookie-cutter)
#+end_src
** The =music.el= Module
This module has all kinds of stuff for music, such as EMMS.
*** =music.el='s EMMS Configuration
EMMS stands for Emacs Multi-Media System, and it's basically an interface for connecting to various applications for playing sound and video.
#+begin_src emacs-lisp :tangle "modules/music.el"
  (straight-use-package
   '(emms :type git
          :host github
          :repo "emacsmirror/emms"
          :files (:defaults)))

  (require 'emms)

  (emms-minimalistic)

  ;; Add actual config later
#+end_src
*** =music.el='s Provide
#+begin_src emacs-lisp :tangle "modules/music.el"
  (provide 'music)
#+end_src
** The =games.el= Module
There are a lot of text-based games that integrate with Emacs, and these are the collections of those.
*** =games.el='s Minesweeper Game
#+begin_src emacs-lisp :tangle "modules/games.el"
#+end_src
* Emacs Library Modules (=lisp/=)
This effectively contains all lisp code that isn't part of my configuration and
instead is for a package that I wrote (which can still appear in =modules/=).
** The =rappeler.el= Module
This is basically a short and sweet reminder function. It works only in Windows
as of now.
#+begin_src emacs-lisp :tangle "lisp/rappeler.el"
  ;;; Dependencies
  (require 'alert-toast)

  ;;; Code
  (defun 2e-emacs-remind (reminder parent)
    (with-output-to-temp-buffer "Reminder"
      (princ (format "%s\n" reminder))
      (princ (format-time-string "Sent at: %H:%M\n"))
      (princ (format "Sent by %s\n" parent)))
    (alert-toast-notify `(:title ,parent :message ,reminder :data (:alarm default :long t))))
#+end_src
