modules/zettelkasten.el
 '(dendroam :type git
            :host github
            :repo "2eAsteroid/dendroam"
            :files (:defaults)))

(require 'dendroam)

(straight-use-package
 '(org-roam-bibtex :type git
                   :host github
                   :repo "org-roam/org-roam-bibtex"
                   :files (:defaults)))

(require 'org-roam-bibtex)

(setq bibtex-completion-bibliography '("~/.emacs.d/zettels/biblio.bib"))   ; This allows bibtex-completion to not throw a fit

(provide 'zettelkasten)
